#!/usr/bin/env perl

use warnings;
use strict;
use utf8;
use open ':utf8';       # all open() use UTF-8
use open ':std';        # standard filehandles too

my $start = 1;
while (<>) {
    s/[~∼～]/~/g;
    s/[·ㆍ]/·/g;
    s/['‘’˙`]/'/g;
    s/[“”"]/"/g;
    foreach my $word (split) {
	if ($word =~ /^<[^<>]+>$/) {
	    print "$word\n";
	    $start = 0
	}
	else {
	    $word =~ s/([0-9]+([.,][0-9]+)?|[A-Za-z]+|[.?!…,\/.:;·ㆍㆍ'|"|‘|’|“|”|“|\＊|＇|\＿\＿|#$|\%|&()*+<=>@\ \-\[\\\]\^`{}~°±²¶¼½¿×ß÷ˇ˘˙˚|˝|ΔΦΩαβγδθλμνπφχψω―‘|’|“|”|†‡‥…′″※₁₂₃℃℉ℓ№ΩÅ⅓⅔⅛ Ⅰ\.|Ⅱ\.|Ⅲ\.|Ⅳ\.|Ⅴ\.|Ⅵ\.|Ⅶ\.|Ⅷ\.|Ⅸ\.|Ⅹ\.|ⅰ\.|ⅱ\.|ⅲ\.|ⅳ\.|ⅴ\.|ⅵ\.|ⅶ\.|ⅷ\.|ⅸ\.|ⅹ\.|ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩⅰⅱⅲⅳⅴⅵⅶⅷⅸⅹ←↑→↓↔↗↙⇒⇔∀∃∇∈√∞∠∥∧∨∩∪∫∴∵∼∽≠≡≥≪≫⊃⊆⊙⌒①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑴⑵⑶⑷⑸⑹⑺⑻⑼⑽⑾⒜⒝⒞ⓐⓑⓒⓓⓔⓛⓝⓧ─━│┬┼▒■□▣▦▨▲△▶▷▼▽◀◁◆◇◈○◎●◐◑★☆☎☞♀♂♠♡♣♤♥♧♨♩♪♬♭➀➌、。〃〈〉《》「」『』【】〓〔〕㉠㉡㉢㉣㉤㉥㉦㉧㉨㉩㉪㉫㉬㉭㉮㉯㉰㉱㉲㉳㉴㉵㉶㉷㉸㉹㉺㉻㎉㎎㎏㎐㎖㎗㎜㎝㎞㎡㎢㎥㎾㏄㏊＞～∥★■~∼\-])/ $1 /g;
	    $word =~ s/  / /g;
	    $word =~ s/^ //;
	    $word =~ s/ $//;
	    $word =~ tr/ /\n/;
	    print "<seg>\n$word\n</seg>\n";
	    $start = 0;
	    
	    if ($word =~ /[.!?][")']*/) {
		# add newline after sentences
		print "\n";
		$start = 1;
	    }
	}
    }
}
print "\n" unless $start;
